// mockReviews.js
export const ReviewMock = [
  {
    name: "Prasitthichok",
    date: "04/04/2025  09:34 AM",
    rating: 5,
    images: [
      "/public/images/review/pic1-1.png",
      "/public/images/review/pic1-2.png",
      "/public/images/review/pic1-3.png",
      
    ],
    comment:
      "บริการดีมากครับ ผู้ดูแลให้คำปรึกษาดีมากเลยครับ ตัวสินค้าตรวจเช็คแล้วมีคุณภาพได้มาตรฐาน ทางบริษัทมีความน่าเชื่อถือ จะติดปัญหาก็คือเรื่องระยะเวลาการจัดส่งและติดตั้งสินค้าที่ล่าช้ากว่าที่กำหนดไว้หน่อย แต่โดยรวมดีมาก ประทับใจครับ",
  },
  {
    name: "Sasivimon",
    date: "23/03/2025  10:12 AM",
    rating: 5,
    images: [
      "/public/images/review/pic2-1.png",
      "/public/images/review/pic2-2.png",
    ],
    comment:
      "ก่อนติดตั้งเรามีคำถามและข้อสงสัยเยอะมากเลยค่ะเกี่ยวกับระบบโซลาร์เซลล์ ทั้งเรื่องงบประมาณ การผลิตไฟ ความคุ้มค่าในระยะยาว ซึ่งทางทีมงานของบริษัทให้ข้อมูลละเอียดครบถ้วน ตอบคำถามแบบตรงไปตรงมา และไม่มีการยัดเยียดขายของ ทำให้เรารู้สึกเชื่อมั่น และตัดสินใจได้ง่ายขึ้นมาก จุดนี้ขอชมว่าให้บริการแบบมืออาชีพจริง ๆ ค่ะ",
  },
  {
    name: "Phikainongbanphaeo",
    date: "12/03/2025  06:19 AM",
    rating: 4,
    images: [
      "/public/images/review/pic3-1.png",
      "/public/images/review/pic3-2.png",
      "/public/images/review/pic3-3.png",
      "/public/images/review/pic3-4.png",
    ],
    comment:
      "เมื่อถึงวันติดตั้งทีมช่างมาทำงานตรงเวลา อุปกรณ์ครบ ไม่มีตกหล่น ใช้เวลาทำงานไม่นานก็เรียบร้อย แถมยังเก็บงานได้สะอาดมากครับ ไม่มีเศษวัสดุเหลือทิ้งไว้ให้เจ้าของบ้านต้องมาทำความสะอาดเองเลยจุดที่ผมชอบที่สุดก็คือหลังติดตั้งเสร็จทีมงานที่มาติดตั้งให้ยังสาธิตวิธีการใช้งานแอป ดูพลังงานให้ด้วย เข้าใจง่ายและใช้งานได้จริงครับ",
  },
   {
    name: "Duangkamon",
    date: "09/03/2025  05:21 AM",
    rating: 4,
    images: [
      "/public/images/review/pic4.png",
    ],
    comment:
      "โดยรวมคุ้มค่ากับเงินที่จ่ายไป แต่ถ้าราคาอุปกรณ์บางอย่างจะยืดหยุ่นหรือต่อรองได้มากกว่านี้อีกนิดก็จะดีมากค่ะ",
  },
  {
    name: "Khunsamonkengngan",
    date: "26/02/2025  11:48 AM",
    rating: 4,
    images: [
      "/public/images/review/pic5-1.png",
      "/public/images/review/pic5-2.png",
    ],
    comment:
      "เรื่องราคาถือว่าสูงอยู่พอสมควร ถ้าเทียบกับการลงทุนทั่ว ๆ ไป แต่ก็เข้าใจได้เพราะเป็นของที่ต้องใช้คุณภาพและความปลอดภัยสูง แต่ส่วนที่ฉันคิดว่าน่าปรับปรุงได้คือออปชั่นเสริมบางอย่างที่ราคาแรง เช่น การเพิ่มแบตเตอรี่หรือระบบสำรองไฟ ซึ่งถ้ามีโปรโมชันหรือทางเลือกที่ยืดหยุ่นมากกว่านี้ก็จะดีมาก อย่างไรก็ตาม โดยรวมก็ยังถือว่าคุ้มค่ากับสิ่งที่ได้รับค่ะ",
  },
  {
    name: "Akkarasamphong",
    date: "18/03/2025  07:06 AM",
    rating: 4,
    images: [
      "/public/images/review/pic6-1.png",
      "/public/images/review/pic6-2.png",
    ],
    comment:
      "ติดตั้งรวดเร็ว เก็บงานเรียบร้อย ระบบโซลาร์ที่ได้ก็ใช้งานได้ดีตามที่โฆษณาไว้ เห็นผลชัดเรื่องค่าไฟลดลงหลังใช้งานประมาณเดือนนึง",
  },
];
