import React from "react";
import TypeBox from "./๊UI/TypeBox";

function Type() {
  return (
    <>
      <div className="flex flex-wrap gap-6 justify-center my-[50px] mx-[150px] text-center">
        {/* Mono */}
        <TypeBox
          image="/public/images/home/mono.png"
          title="แผงโซล่าเซลล์โมโนคริสตัลไลน์"
          subtitle="Monocrystalline Silicon Solar Cells"
          detail="เป็นแผงที่ทำมาจากซิลิคอนทรงกระบอกบริสุทธิ์รูปทรงของเซลล์จะมีสีเข้ม
              มุมทั้งสี่มุมจะเป็นสี่เหลี่ยมมุมตัด
              สามารถผลิตไฟได้ดีแม้แสงแดดจะน้อยก็ตาม
              และเมื่อเทียบกำลังวัตต์ที่เท่ากัน แผงโซลาร์เซลล์แบบ Mono
              Crystalline จะมีขนาดเล็กกว่า มีอายุการใช้งานที่ยาวนานที่สุด 25 -
              40 ปี"
          usage="บ้านพักอาศัย, อาคารที่มีพื้นที่ติดตั้งจำกัด"
        />

        {/* Poly */}
        <TypeBox
          image="/public/images/home/poly.png"
          title="แผงโซล่าเซลล์โพลีคริสตัลไลน์"
          subtitle="Polycrystalline Silicon Solar Cells"
          detail="ทำมาจากผลึกซิลิคอน โดยทั่วไปเรียกว่า โพลีคริสตัลไลน์
              (polycrystalline,p-Si)
              โดยในกระบวนการผลิตสามารถที่จะนำเอาซิลิคอนเหลวมาเทใส่โมลด์ที่เป็นสี่เหลี่ยมได้เลย
              ก่อนที่จะนำมาตัดเป็นแผ่นบางอีกที
              จึงทำให้เซลล์แต่ละเซลล์เป็นรูปสี่เหลี่ยมจัตุรัส ไม่มีการตัดมุม
              สีของแผงจะออกน้ำเงินไม่เข้มมาก"
          usage="บ้าน, ฟาร์มโซลาร์, โครงการขนาดใหญ่ที่มีพื้นที่กว้าง"
        />

        {/* Thin Film */}
        <TypeBox
          image="/public/images/home/thin.png"
          title="แผงโซล่าเซลล์ฟิล์มบาง"
          subtitle="Thin Film Solar Cells"
          detail="หลักการโดยทั่วไปของการผลิต คือ
              การนำเอาสารที่สามารถแปลงพลังงานจากแสงเป็นกระแสไฟฟ้ามาฉาบเป็นฟิล์มหรือชั้นบางๆ
              ซ้อนกันหลายๆ ชั้น จึงเรียกโซล่าเซลล์ชนิดนี้ว่าฟิล์มบาง หรือ thin
              film ซึ่งสารฉาบที่ว่านี้ก็มีด้วยกันหลายชนิด
              ชื่อเรียกของแผงโซล่าเซลล์ชนิดฟิล์มบางจึงแตกต่างกันออกไป
              ขึ้นอยู่กับชนิดวัสดุที่นำมาใช้"
          usage={
            <ul className="list-disc ml-6 mt-1 text-[15px]">
              <li>
                อาคารที่ต้องการน้ำหนักเบา เช่น หลังคาเบา ๆ, โครงสร้างเหล็ก
              </li>
              <li>อุปกรณ์พกพา เช่น เครื่องชาร์จโซลาร์แบบพกพา</li>
              <li>โครงการขนาดใหญ่มากที่ไม่เน้นประสิทธิภาพสูงสุด</li>
            </ul>
          }
        />
      </div>
    </>
  );
}

export default Type;
