import React from "react";

function ShopDetail() {
  return (
    <div className="w-2/3 space-y-4 text-xl">
      <p>
        Jjordgobpb Solar ก่อตั้งขึ้นในปี พ.ศ. 2557 <br />
        ด้วยความมุ่งมั่นที่จะนำพลังงานสะอาดจากแสงอาทิตย์มาใช้ให้เกิดประโยชน์สูงสุดในประเทศไทย
        เราเชี่ยวชาญด้าน การวิเคราะห์และติดตั้งระบบโซลาร์เซลล์ครบวงจร
        ทั้งสำหรับบ้านพักอาศัย ธุรกิจ และโรงงานอุตสาหกรรม <br />
        <br />
        ตลอดกว่า 10 ปี ที่ผ่านมา เราได้ให้บริการลูกค้ามาแล้วมากกว่า 1,000
        โครงการทั่วประเทศ
        ทีมงานมืออาชีพและระบบการวิเคราะห์ที่ได้รับการรับรองมาตรฐานระดับสากล
        เราใส่ใจในทุกขั้นตอน ตั้งแต่การวิเคราะห์เบื้องต้นหน้างาน
        การเลือกใช้วัสดุคุณภาพสูง ไปจนถึงการติดตั้งที่ได้มาตรฐาน
        เพื่อให้ลูกค้าทุกท่านได้รับประสิทธิภาพการผลิตพลังงานสูงสุดและผลตอบแทนที่คุ้มค่าที่สุด
      </p>
    </div>
  );
}

export default ShopDetail;
